GREETING_MESSAGE = ''' 
Привет! Это чат-бот, который будет хранить, редактировать и удалять твои контакты.
Чтобы начать работу с ботом тебе следует изучить инструкцию:

<b>1) /start</b> - <em>начать взаимодействие с ботом</em>
<b>2) /help</b> - <em>посмотреть инструкцию</em>
<b>3) /add</b> - <em>добавить новый контакт</em>
<b>4) /edit</b> - <em>редактировать контакт</em>
<b>5) /delete</b> - <em>удалить контакт</em>
<b>6) /show</b> all - <em>показать весь список</em>
<b>7) /find</b> - <em>найти контакт</em>
<b>8) /stop</b> - <em>завершит работу с ботом</em>'''

HELP_COMMAND: str = '''
<b>1) /start</b> - <em>начать взаимодействие с ботом</em>
<b>2) /help</b> - <em>посмотреть инструкцию</em>
<b>3) /add</b> - <em>добавить новый контакт</em>
<b>4) /edit</b> - <em>редактировать контакт</em>
<b>5) /delete</b> - <em>удалить контакт</em>
<b>6) /show all</b>  - <em>показать весь список</em>
<b>7) /find</b> - <em>найти контакт</em>
<b>8) /stop</b> - <em>завершит работу с ботом</em>'''

API_TOKEN: str = '6095174890:AAGXxm5XbEJrmAXBxOgVI9zGyHKWLUfktW0'

admin_ids: list[int] = [814712435]
